# MacroManager Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
MacroManager Methods
MacroManager Class See Also
---
The MacroManager type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddModule | Adds a MacroModule to the application or document. |
| Contains | Indicates the given module is a member of this collection. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetApplicationMacroSecurityOptions | Gets the application macro security options. |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetDocumentMacroSecurityOptions | Gets the document macro security options. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetMacroManager(Application) | Gets the Macro manager from the application. |
| GetMacroManager(Document) | Gets the Macro manager from the document. |
| GetMacroManagerIterator | Returns a Macro manager iterator that iterates through the collection. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| RemoveModule | Removes a MacroModule from the application or document. |
| SetApplicationMacroSecurityOptions | Sets the application macro security options. |
| SetDocumentMacroSecurityOptions | Sets the document macro security options. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace